In [11]:
people = {
    'first' : ['Corey', 'Jane', 'John'],
    'last' : ['Schafer', 'Doe', 'Doe'],
    'email' : ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}
import pandas as pd
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [12]:
df['first'] + ' ' + df['last']
# 서로 다른 column을 합하는 방법. 그냥 더하면 됨

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [13]:
df['full_name'] = df['first'] + ' ' + df['last']
# 새로운 column을 만드는 방법. 그냥 새로운 column name을 pass해서 만들면 됨

In [14]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [15]:
df.drop(columns = ['first', 'last'],inplace = True)
# 특정 column 지우기

In [16]:
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [23]:
df['full_name'].str.split(' ', expand = True)
# full_name column에 접근한 후 해당 series의 값들을 str으로 받고, split method를 사용한 것임.
# 그리고 나서 split로 쪼갠 값들을 expand를 사용해서 dataframe형식으로 expand한 것임

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [24]:
df[['first','last']] = df['full_name'].str.split(' ', expand = True)

In [25]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [27]:
df.append({'first' : 'Tony'}, ignore_index = True)
# row wise data를 추가하는 방법은 append method를 사용하면 됨.
# ignore_index = True 는 dict에서 pass하지 않은 KEY(column) value들에 대한 오류를 무시하는 것임

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN   Tony      NaN

In [28]:
people = {
    'first' : ['Tony', 'Steve'],
    'last' : ['Stark', 'Rogers'],
    'email' : ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)

In [29]:
df2

   first    last               email
0   Tony   Stark  IronMan@avenge.com
1  Steve  Rogers      Cap@avenge.com

In [31]:
df.append(df2, ignore_index= True, sort = False)
두 개의 data frame도 append method를 이용해서 합칠 수 있음.

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [32]:
df = df.append(df2, ignore_index= True, sort = False)

In [33]:
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers

In [34]:
df.drop(index=4)
# row를 remove하는 것은 column remove와는 다르게 index=를 pass해주면 됨

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3       IronMan@avenge.com            NaN   Tony    Stark

In [36]:
filt = (df['last'] == 'Doe')
df.drop(index = df[filt].index)
# 특정 조건을 만족하는 row만 삭제하려면 index number를 pass하는 것이 아니라 filter.index를 pass하면 됨

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3       IronMan@avenge.com            NaN   Tony    Stark
4           Cap@avenge.com            NaN  Steve   Rogers